// پیام‌های خطا برای اعتبارسنجی ورودی‌ها
export const errorMessages = {
    // خطاهای عمومی
    connectionError: 'خطا در برقراری ارتباط',
    emptyField: 'لطفا این قسمت را خالی نگذارید',
    emptyRequiredField: 'اینجا را خالی نگذارید',
    invalidText: 'لطفا متن معتبر وارد کنید',

    // خطاهای مربوط به شماره موبایل و ایمیل
    invalidMobileOrEmail: 'شماره موبایل یا ایمیل نادرست است.',
    invalidMobileFormat: 'شماره موبایل به شکل درست وارد نشده',
    invalidEmail: 'پست الکترونیک وارد شده درست نیست',
    phoneRequired: 'شماره تلفن را وارد کنید.',
    phoneIncomplete: 'شماره تلفن را کامل وارد نمایید',

    // خطاهای مربوط به کدملی و کد پستی
    invalidNationalId: 'کدملی معتبر نیست',
    invalidPostalCode: 'کد پستی وارد شده درست نیست',

    // خطاهای مربوط به شماره کارت و شبا
    invalidCardNumber: 'شماره کارت معتبر نیست',
    invalidShebaNumber: 'شماره شبا نامعتبر است',

    // خطاهای مربوط به رمز عبور
    shortPassword: 'رمز عبور کوتاه است',
    passwordMismatch: 'رمز عبور و تکرار آن برابر نیستند',

    // خطاهای مربوط به نام و نام‌خانوادگی
    shortFirstName: 'نام باید حداقل ۲ کاراکتر باشد',
    longFirstName: 'نام باید حداکثر ۵۰ کاراکتر باشد',
    shortLastName: 'نام‌خانوادگی باید حداقل ۲ کاراکتر باشد',
    longLastName: 'نام‌خانوادگی باید حداکثر ۵۰ کاراکتر باشد',
    invalidFirstNameCharacters: 'نام باید فقط از حروف تشکیل شده باشد',
    invalidLastNameCharacters: 'نام‌خانوادگی باید فقط از حروف تشکیل شده باشد',

    // خطاهای مربوط به آدرس
    shortAddress: 'نشانی پستی باید حداقل ۶ حرف داشته باشد',

    // خطاهای مربوط به شرکت
    emptyCompanyName: 'نام شرکت نمی تواند خالی باشد.',
    shortCompanyName: 'نام شرکت باید بلندتر از ۵ حرف باشد.',
    invalidEconomicCode: 'کد اقتصادی نادرست است.',
    registrationNumberRequired: 'شماره ثبت را وارد کنید.',

    // خطاهای مربوط به کدهای عددی
    numericOnly: 'مقدار وارد شده باید فقط شامل عدد باشد.',
    invalidVerificationCode: 'کد تایید باید ۵ رقمی باشد',
    economicCodeLength: 'این کد باید بین ۱۲ الی ۱۴ رقم باشد.',

    // خطاهای مربوط به قیمت
    lowPrice: 'قیمت وارد شده نمی‌تواند کمتر از ۱۰ هزار تومان باشد.',
    priceExceedsProduct: 'قیمت واردشده بالاتر از قیمت محصول است',

    // خطاهای مربوط به وب‌سایت
    invalidWebsite: 'آدرس وب‌سایت اشتباه است. لطفاً آن را مثل نمونه بنویسید.',

    // خطاهای مربوط به آپلود فایل
    maxPhotos: 'شما حداکثر می‌توانید ۵ عکس آپلود کنید',
    maxVideos: 'شما حداکثر می‌توانید ۳ ویدیو آپلود کنید',
    maxFiles: 'شما حداکثر می‌توانید ۸ فایل آپلود کنید',

    // خطاهای مربوط به متن
    textTooLong: 'متن شما طولانی‌تر از حد مجاز است، لطفاً آن را کوتاه‌تر کنید',

    // خطاهای مربوط به انتخاب‌ها
    provinceNotSelected: 'استان انتخاب نشده است',
    cityNotSelected: 'شهر انتخاب نشده است',
    invalidJob: 'شغل انتخاب شده معتبر نیست.',

    // خطاهای خاص
    invalidChassisOrEngineNumber: 'شماره شاسی یا شماره موتور باید انگلیسی باشد',
};